it/src/Documents/ПокупкаПоддержкиЛицензий/ПокупкаПоддержкиЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПокупкаПоддержкиЛицензий</name>
  <registerRecords>InformationRegister.ПоддержкаЛицензий</registerRecords>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаПоддержки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокДействия_Месяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

it/src/Documents/ПокупкаПоддержкиЛицензий/ManagerModule.bsl
Функция ПолучитьТаблицуЗакупки(ДополнительныеСвойства) Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ДокументПоступления.Ссылка.Организация,
	                |	ДокументПоступления.ОсновноеСредство.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
	                |	ДокументПоступления.ОсновноеСредство КАК Лицензия,
	                |	1 КАК Количество,
	                |	ДокументПоступления.Стоимость,
	                |	ДокументПоступления.Ссылка.Дата КАК Период,
	                |	ДокументПоступления.Ссылка КАК Регистратор,
	                |	ДокументПоступления.НомерСтроки,
	                |	ДокументПоступления.ОсновноеСредство.ВидОсновногоСредства КАК ВидОсновногоСредства
	                |ИЗ
	                |	Документ.ПокупкаПоддержкиЛицензий.ОсновныеСредства КАК ДокументПоступления
	                |ГДЕ
	                |	ДокументПоступления.Ссылка = &Ссылка
	                |	И ДокументПоступления.ОсновноеСредство.ВидОсновногоСредства = &Лицензия";
					
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	Запрос.УстановитьПараметр("Лицензия", Справочники.ВидыОсновногоСредства.Лицензия); 
	
	Возврат Запрос.Выполнить().Выгрузить();
	 
КонецФункции //ПолучитьТаблицуЗакупкиЛицензий	
 
 Функция ПолучитьТаблицуПоддержкиЛицензий(ДополнительныеСвойства) Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ДокументПоступления.Ссылка.Организация,
	                |	ДокументПоступления.ОсновноеСредство,
	                |	ДокументПоступления.Стоимость,
	                |	ДокументПоступления.Ссылка.Дата КАК Период,
	                |	ДокументПоступления.Ссылка КАК Регистратор,
	                |	ДокументПоступления.НомерСтроки,
	                |	ДокументПоступления.СрокДействия_Месяц,
	                |	ДокументПоступления.ДатаНачалаПоддержки КАК ДатаНачала
	                |ИЗ
	                |	Документ.ПокупкаПоддержкиЛицензий.ОсновныеСредства КАК ДокументПоступления
	                |ГДЕ
	                |	ДокументПоступления.Ссылка = &Ссылка
	                |	И ДокументПоступления.ОсновноеСредство.ВидОсновногоСредства = &Лицензия";
					
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	Запрос.УстановитьПараметр("Лицензия", Справочники.ВидыОсновногоСредства.Лицензия);
	
	Возврат Запрос.Выполнить().Выгрузить();
	 
КонецФункции //ПолучитьТаблицуЗакупкиЛицензий
